<template>
  <div id="userprotocol">
    <!-- 标题 -->
    <div class="title">
      用户协议 (丰收网注册&服务协议)
    </div>
    <!-- 前言 -->
    <div>
      <p>【前言】欢迎您使用丰收网的服务！</p>
      为更好的使用丰收网的服务，您应当阅读并遵守《丰收网服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款。限制、免责条款可能以黑体加粗形式提示您注意。除非您已阅读并接受本协议所有条款，否则您无权使用丰收网提供的服务。您使用丰收网的服务即视为您已阅读并同意上述协议的约束。如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。
    </div>
    <!-- 全文 -->
    <div>
      <p>一、【协议的范围】</p>
      <span>1.1 </span>本协议是您与丰收网之间关于用户使用丰收网相关服务所订立的协议。“丰收网”是指杭州丰收网络科技有限公司及其相关服务可能存在的运营关联单位。“用户”是指使用丰收网相关服务的使用人，在本协议中更多地称为“您”。<br>
      <span>1.2 </span>本协议项下的具体服务内容是指丰收网根据实际情况，向用户提供的包括虚拟物品交易商城、赛事参与平台、新闻评论和广告等产品及服务（以下简称“本服务”）。
    </div>
    <div>
      <p>二、【帐号与密码安全】</p>
      <span>2.1 </span>您在使用丰收网的服务时可能需要注册一个帐号。丰收网特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受盗号或密码失窃，责任由您自行承担。<br>
      <span>2.2 </span>您不应将自己的帐号、密码转让或出借予他人使用。如您发现自己的帐号遭他人非法使用，应立即通知丰收网。并有权通知丰收网采取措施暂停该账号的登录和使用。同时，您也应向丰收网提供与被停用账号注册信息相一致的个人有效身份信息。丰收网核实您所提供的个人有效身份信息与所注册的身份信息相一致的，应当及时采取措施暂停该账号的登录和使用。丰收网违反前述约定，未及时采取措施暂停用户账号的登录和使用，因此而给您造成损失的，将有丰收网承担。若您没有提供个人有效身份证件或者用户提供的个人有效身份信息与所注册的身份信息不一致的，丰收网有权拒绝用户上述请求。此外，因黑客行为或您的保管疏忽导致帐号、密码遭他人非法使用，丰收网不承担任何责任。<br>
      <span>2.3 </span>您注册的帐号自注册起90天内或连续365天，没有使用过该帐号（包括使用该帐号登录网站、充值），则丰收网有权删除该帐号。<br>
    </div>
    <div>
      <p>三、【用户个人信息保护】</p>
      <span>3.1 </span>保护您的个人信息是丰收网的一项基本原则。<br>
      <span>3.2 </span>您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本服务或在使用过程中受到限制。<br>
      <span>3.3 </span>一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。<br>
      <span>3.4 </span>丰收网将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。<br>
      <span>3.5 </span>未经您的同意，丰收网不会向丰收网以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。<br>
      <span>3.6 </span>丰收网非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用丰收网的服务前，应事先取得您家长或法定监护人（以下简称"监护人"）的书面同意。<br>
    </div>
    <div>
      <p>四、【使用本服务的方式】</p>
      <span>4.1 </span>您承诺以真实身份注册成为丰收网的用户，并保证所提供的个人身份资料信息真实、完整、有效，依据法律规定和必备条款约定对所提供的信息承担相应的法律责任。您以真实身份注册成为丰收网用户后，需要修改所提供的个人身份资料信息的，丰收网应当及时、有效地为您提供该项服务。<br>
      <span>4.2 </span>丰收网有权审查您注册时所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障您账号的安全、有效；您有义务妥善保管您的账号及密码，并正确、安全地使用您的账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给您和他人的民事权利造成损害的，应当承担由此产生的法律责任。<br>
      <span>4.3 </span>您对登录后所持账号产生的行为依法享有权利和承担责任。<br>
      <span>4.4 </span>除非您与丰收网另有约定，您同意本服务仅为您个人使用。<br>
      <span>4.5 </span>您应当通过丰收网提供或认可的方式使用本服务。您依本协议条款所取得的权利不可转让。<br>
      <span>4.6 </span>您不得使用未经丰收网授权的插件、外挂或第三方工具对本协议项下的服务进行干扰、破坏、修改或施加其他影响。<br>
      <span>4.7 </span>您通过服务对程序的使用受制于某些已经包含在规则中的行为准则。这些规则将在丰收网官方网站公开并不定期更新，所有通过服务使用程序的用户必须遵守。您有义务知晓、了解并遵守这些行为规则。丰收网保留权利决定何种行为违反游戏精神，并对该等行为采取其认为合适的相应的处理措施（包括警告、扣除虚拟货币、暂时或永久冻结账号、拒绝提供服务等）。丰收网保留随时修改这些行为规则的权利。<br>
    </div>
    <div>
      <p>五、【按现状提供服务】</p>
      <span>5.1 </span>您理解并同意，丰收网的服务是按照现有技术和条件所能达到的现状提供的。丰收网会尽最大努力向您提供服务，确保服务的连贯性和安全性；但丰收网不能随时预见和防范法律、技术以及其他风险，包括不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。<br>
    </div>
    <div>
      <p>六、【自备设备】</p>
      <span>6.1 </span>您应当理解，您使用丰收网的服务需自行准备与相关服务有关的终端设备（如电脑、调制解调器等装置），并承担所需的费用（如电话费、上网费等费用）。<br>
      <span>6.2 </span>您理解并同意，您使用本服务时会耗用您的终端设备和带宽等资源。<br>
    </div>
    <div>
      <p>七、【广告】</p>
      <span>7.1 </span> 您理解并同意，丰收网可以在提供服务的过程中自行或由第三方广告商向您发送广告、推广或宣传信息（包括商业与非商业信息），其方式和范围可不经向您特别通知而变更。<br>
      <span>7.2 </span>丰收网依照法律的规定对广告商履行相关义务，您应当自行判断广告信息的真实性并为自己的判断行为负责，除法律明确规定外，您因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，丰收网不承担责任。<br>
    </div>
    <div>
      <p>八、【收费服务】</p>
      <span>8.1 </span>丰收网的部分服务是以收费方式提供的，如您使用收费服务，请遵守相关的协议。<br>
      <span>8.2 </span>丰收网可能根据实际需要对收费服务的收费标准、方式进行修改和变更，丰收网也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，丰收网将在相应服务页面进行通知或公告。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。<br>
    </div>
    <div>
      <p>九、【第三方提供的产品或服务】</p>
      <span>9.1</span>您在丰收网平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。丰收网和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。<br>
    </div>
    <div>
      <p>十、【本服务中的软件】</p>
      您在使用本服务的过程中可能需要下载软件，对于这些软件，丰收网给予您一项个人的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用这些软件。 为了改善用户体验、保证服务的安全性及产品功能
    </div>
    <div>
      <p>十一、【知识产权声明】</p>
      丰收网在本服务中提供的内容（包括网页、文字、图片、音频、视频、图表等）的知识产权归丰收网所有，您在使用本服务中所产生的内容的知识产权归您或相关权利人所有。<br> 除另有特别声明外，丰收网提供本服务时所依托软件的著作权、专利权及其他知识产权均归丰收网所有。
      <br> 丰收网在本服务中所使用的“C币”、“丰收网”、 logo形象等商业标识，其著作权或商标权归丰收网所有。<br> 上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经丰收网、您个人或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。
      <br>
    </div>
    <div>
      <p>十二、【用户违法行为】</p>
      您在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，包括：<br> ( 1 ) 发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；<br> ( 2 ) 发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；<br> ( 3 ) 恶意虚构事实、隐瞒真相以误导、欺骗他人；<br> ( 4 ) 发布、传送、传播广告信息及垃圾信息；<br> ( 5 ) 其他法律法规禁止的行为。<br> 如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求丰收网给予协助。造成损害的，您应依法予以赔偿，丰收网不承担任何责任。
      <br> 如果丰收网发现或收到他人举报您发布的信息违反本条约定，丰收网有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，丰收网有权视您的行为性质，采取包括暂停或终止服务，限制、冻结或终止账号使用，追究法律责任等措施。
      <br> 您违反本条约定，导致任何第三方损害的，您应当独立承担责任；丰收网因此遭受损失的，您也应当一并赔偿。
      <br>
    </div>
    <div>
      <p>十三、【遵守当地法律监管】</p>
      您在使用本服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。<br> 您应避免因使用本服务而使丰收网卷入政治和公共事件，否则丰收网有权暂停或终止对您的服务。
      <br>
    </div>
    <div>
      <p>十四、【用户发送、传播的内容与第三方投诉处理】</p>
      您通过丰收网发送或传播的内容（包括网页、文字、图片、音频、视频、图表等）均由您自行承担责任。<br>
    </div>
    <div>
      <p>十五、【不可抗力及其他免责事由】</p>
      您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，丰收网将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失丰收网在法律允许的范围内免责<br> 在法律允许的范围内，丰收网对以下情形导致的服务中断或受阻不承担责任：
      <br> ( 1 ) 受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；<br> ( 2 ) 您或丰收网的电脑软件、系统、硬件和通信线路出现故障；<br> ( 3 ) 您操作不当；<br> ( 4 ) 您通过非丰收网授权的方式使用本服务；<br> 您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，丰收网不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括：
      <br> 来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；
      <br> 因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；
      <br> 其他因网络信息或用户行为引起的风险。
      <br> 您理解并同意，本服务并非为某些特定目的而设计，包括核设施、军事用途、医疗设施、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，丰收网不承担法律责任。
      <br> 丰收网依据本协议约定获得处理违法违规内容的权利，该权利不构成丰收网的义务或承诺，丰收网不能保证及时发现违法行为或进行相应处理。
      <br> 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意丰收网有关防范诈骗犯罪的提示。
      <br>
    </div>
    <div>
      <p>十六、【协议的生效与变更】</p>
      您使用丰收网的服务即视为您已阅读本协议并接受本协议的约束。<br> 丰收网有权在必要时修改本协议条款。您可以在相关服务页面查阅最新版本的协议条款。
      <br> 本协议条款变更后，如果您继续使用丰收网提供的软件或服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用丰收网提供的软件或服务。
      <br>
    </div>
    <div>
      <p>十七、【服务的变更、中断或终止】</p>
      鉴于网络服务的特殊性，您同意丰收网有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。如变更、中断或终止的网络服务属于免费网络服务，丰收网无需通知您，也无需对您或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，丰收网应当在变更、中断或终止之前事先通知您，并应向您提供等值的替代性的收费网络服务，如您不愿意接受替代性的收费网络服务，就您已经向丰收网支付的服务费，丰收网应当按照您实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服务费退还给您。<br> 您理解并同意，丰收网需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，丰收网无需为此承担任何责任，但丰收网将尽可能事先进行通告。
      <br> 丰收网服务及附带相关软件的各个新版本，丰收网可以自行决定是否保留为丰收网服务增加附加特点和功能，或者提供程序编程之修补、更新和升级的权利。丰收网无需向您发出通知即可自行决定修改、停止或暂停您对任何版本丰收网服务的使用，和/或禁用您已经使用或安装的丰收网服务，以便对相关技术进行检修、改良和/或升级，或者出于其他合理原因；对于由发行和/或不发行丰收网服务的新版本而导致的直接或间接损害，丰收网将不承担任何赔偿责任。
      <br> 任何时候，如丰收网发现用户在注册或使用的帐号、角色、行会等一切自定义名称与其他用户相同而导致无法识别，丰收网有权要求用户修改上述名称，如用户在要求的时限内未予修改，则丰收网有权在用户自定义的名称后加注识别符号予以区别以确保游戏正常运行，用户保证无条件同意上述修改。
      <br> 如发生下列任何一种情形，丰收网有权不经通知而中断或终止向您提供的服务：
      <br> ( 1 ) 根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；<br> ( 2 ) 您违反相关法律法规或本协议的约定；<br> ( 3 ) 按照法律规定或主管部门的要求；<br> ( 4 ) 出于安全的原因或其他必要的情形。<br> 丰收网有权按本协议8.2条的约定进行收费。若您未按时足额付费，丰收网有权中断、中止或终止提供服务。
      <br> 您有责任自行备份存储在本服务中的数据。如果您的服务被终止，丰收网可以从服务器上永久地删除您的数据。服务终止后，丰收网没有义务向您返还数据。
      <br>
    </div>
    <div>
      <p>十八、【管辖与法律适用】</p>
      本协议签订地为中华人民共和国浙江省杭州市下城区<br> 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
      <br> 若您和丰收网之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。
      <br> 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
      <br> 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
      <br>
    </div>
    <div>
      <p>十九、【未成年人使用条款】</p>
      若用户未满18周岁，则为未成年人，应在监护人监护、指导下阅读本协议和使用本服务。<br>
      未成年人用户涉世未深，容易被网络虚象迷惑，且好奇心强，遇事缺乏随机应变的处理能力，很容易被别有用心的人利用而又缺乏自我保护能力。因此，未成年人用户在使用本服务时应注意以下事项，提高安全意识，加强自我保护：<br>
      认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活；<br>
      填写个人资料时，加强个人保护意识，以免不良分子对个人生活造成骚扰；<br>
      在监护人或老师的指导下，学习正确使用网络；<br>
      避免陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全。<br>
      监护人、学校均应对未成年人使用本服务时多做引导。特别是家长应关心子女的成长，注意与子女的沟通，指导子女上网应该注意的安全问题，防患于未然。<br>
    </div>
    <div>
      <p>二十、【其他】</p>
      如果您对本协议或本服务有意见或建议，可与丰收网客服联系（联系电话：0571-89990601），我们会给予您必要的帮助。
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style scoped lang='scss'>
#userprotocol {
  width: 1200px;
  background-color: #1b1c1f;
  color: #dcdcdc;
  font-size: 14px;
  margin-top: 88px;
  margin-bottom: 50px;
  text-align: left;
  .title {
    height: 106px;
    width: 100%;
    font-size: 24px;
    color: #f9fdfd;
    line-height: 106px;
    text-align: center;
    background-image: url("../assets/images/News-images/usertitle.png");
  }
  div {
    margin-top: 50px;
    line-height: 32px;
    padding: 0 60px;
    &:first-child {
      margin-top: 0;
    }
    p {
      line-height: 36px;
      color: #e1c076;
      font-size: 18px;
    }
    span {
      color: #e1c076;
    }
  }
}
</style> 